In [1]:
import pandas as pd

In [2]:
visitas = pd.read_csv('Sources/fiuba_3_vistas_concat.csv').drop(['Unnamed: 0','timestamp'], axis=1)

In [3]:
visitas['visito'] = 1

In [4]:
visitas.head()

      idAviso idpostulante  visito
0  1112400775      kPjr2K0       1
1  1112400775      kPjr2K0       1
2  1112426664      GNOwZmb       1
3  1112426664      GNOwZmb       1
4  1112445738      lDLxajz       1

In [5]:
visitas.rename(columns={'idAviso':'idaviso'}, inplace=True)
groups = visitas.groupby(['idpostulante','idaviso']).sum()

In [6]:
groups = groups.reset_index()

In [7]:
groups.to_csv('Sources/visitas_proc.csv')

In [8]:
postulaciones = pd.read_csv('Sources/postulaciones_for_training.csv')

In [9]:
postulaciones.shape

(19783189, 4)

In [10]:
postulaciones.head()

   Unnamed: 0     idaviso idpostulante  sepostulo
0       11941  1112428133       aRAV90        0.0
1       82495  1112410032       10eV0Q        0.0
2         952  1111667482       EkqWmb        0.0
3       87673  1112390628       ZL1PGz        0.0
4       16903  1112300657       eo2AB9        0.0

In [11]:
postulaciones = postulaciones.merge(groups, on=['idaviso','idpostulante'], how='left')
postulaciones.head()

   Unnamed: 0     idaviso idpostulante  sepostulo  visito
0       11941  1112428133       aRAV90        0.0     NaN
1       82495  1112410032       10eV0Q        0.0     NaN
2         952  1111667482       EkqWmb        0.0     NaN
3       87673  1112390628       ZL1PGz        0.0     NaN
4       16903  1112300657       eo2AB9        0.0     NaN

In [22]:
postulaciones.shape

(19704652, 5)